MoCoMakers/night_world_leds/ESP32_controller/led_controller/ESP32camLEDController/ESP32camLEDController.ino
#if !defined ESP32
 #error This sketch is only for an ESP32 Camera module
#endif

#include "esp_camera.h"         // https://github.com/espressif/esp32-camera
#include <Arduino.h>
#include <esp_task_wdt.h>       // watchdog timer   - see: https://iotassistant.io/esp32/enable-hardware-watchdog-timer-esp32-arduino-ide/

// Use this verions - https://github.com/teknynja/Adafruit_NeoPixel/tree/esp32_rmt_memory_allocation_fix_safe
// See: https://forum.arduino.cc/t/neopixel-crash-with-75-pixels-using-esp32-core-3-0-x/1273500/12
#include <Adafruit_NeoPixel.h>

//   ---------------------------------------------------------------------------------------------------------



//                          ====================================== 
//                                   Enter your wifi settings
//                          ====================================== 
// ESP32 WiFi Configuration
#define SSID_NAME "Sandwiches"
#define SSID_PASWORD "123456789m"
#define LAST_IP_OCTET 120 // Values are planned between 120 and 140 with no overlap

// e.g. 192.168.147.120 is the start of the range
#define IP_PREFIX_1 192
#define IP_PREFIX_2 168
#define IP_PREFIX_3 147

//LED Strip Configuration
#define PIN 12
#define N_LEDS 190
#define MAX_BRIGHTNESS 127 // Choose a value between 2 and 255

/* See also these lines in this file
   int cameraImageExposure = 1200;                         // Camera exposure (0 - 1200)   If gain and exposure both set to zero then auto adjust is enabled
   int cameraImageGain = 30;                             // Image gain (0 - 30)
   int cameraImageBrightness = 2;                       // Image brightness (-2 to +2)

   and:
   framesize_t FRAME_SIZE_IMAGE = cyclingRes[4]; // { FRAMESIZE_SVGA, FRAMESIZE_XGA, FRAMESIZE_SXGA, FRAMESIZE_QVGA, FRAMESIZE_VGA }
*/

#define ENABLE_OTA 0                         // If OTA updating of this sketch is enabled (requires ota.h file)
const String OTAPassword = "password";       // Password for performing OTA update (i.e. http://x.x.x.x/ota)




//   ---------------------------------------------------------------------------------------------------------

#define STATIC_IP
#ifdef STATIC_IP
  // Configure this per device
  IPAddress ip(IP_PREFIX_1,IP_PREFIX_2,IP_PREFIX_3,LAST_IP_OCTET);
  IPAddress gateway(IP_PREFIX_1,IP_PREFIX_2,0,1);
  IPAddress subnet(255,255,255,0);
#endif


    // Required by PlatformIO

    // forward declarations
      bool initialiseCamera(bool);            // this sets up and enables the camera (if bool=1 standard settings are applied but 0 allows you to apply custom settings)
      bool cameraImageSettings();             // this applies the image settings to the camera (brightness etc.)
      void changeResolution();                // this changes the capture frame size
      String localTime();                     // returns the current time as a String
      void flashLED(int);                     // flashes the onboard indicator led
      byte storeImage();                      // stores an image in Spiffs or SD card
      void handleRoot();                      // the root web page
      void handlePhoto();                     // web page to capture an image from camera and save to spiffs or sd card
      bool handleImg();                       // Display a previously stored image 
      void handleNotFound();                  // if invalid web page is requested
      void readRGBImage();                    // demo capturing an image and reading its raw RGB data
      bool getNTPtime(int);                   // handle the NTP real time clock
      bool handleJPG();                       // display a raw jpg image
      void handleJpeg();                      // display a raw jpg image which periodically refreshes
      void handleStream();                    // stream live video (note: this can get the camera very hot)
      int requestWebPage(String*, String*, int);  // procedure allowing the sketch to read a web page its self
      void handleTest();                      // test procedure for experimenting with bits of code etc.
      void handleReboot();                    // handle request to restart device
      void handleData();                      // the root web page requests this periodically via Javascript in order to display updating information
      void readGrayscaleImage();              // demo capturing a grayscale image and reading its raw RGB data
      void resize_esp32cam_image_buffer(uint8_t*, int, int, uint8_t*, int, int);    // this resizes a captured grayscale image (used by above)


// ---------------------------------------------------------------
//                           -SETTINGS
// ---------------------------------------------------------------

 char* stitle = "ESP32Cam-demo";                        // title of this sketch
 char* sversion = "01Oct24";                            // Sketch version

 #define WDT_TIMEOUT 60                                 // timeout of watchdog timer (seconds) 

 const bool sendRGBfile = 0;                            // if set to 1 '/rgb' will just return raw rgb data which can then be saved as a file rather than display a HTML pag

 uint16_t dataRefresh = 2;                              // how often to refresh data on root web page (seconds)
 uint16_t imagerefresh = 2;                             // how often to refresh the image on root web page (seconds)

 const bool serialDebug = 1;                            // show debug info. on serial port (1=enabled, disable if using pins 1 and 3 as gpio)
 const int serialSpeed = 115200;                        // Serial data speed to use

 #define useMCP23017 0                                  // set if MCP23017 IO expander chip is being used (on pins 12 and 13)

 // Camera related
   bool flashRequired = 0;                              // If flash to be used when capturing image (1 = yes)
   const framesize_t cyclingRes[] = { FRAMESIZE_SVGA, FRAMESIZE_XGA, FRAMESIZE_SXGA, FRAMESIZE_QVGA, FRAMESIZE_VGA };    // resolutions to use
                                                        // Image resolutions available:
                                                        //               default = "const framesize_t FRAME_SIZE_IMAGE = FRAMESIZE_VGA"
                                                        //               160x120 (QQVGA), 128x160 (QQVGA2), 176x144 (QCIF), 240x176 (HQVGA), 240X240,
                                                        //               320x240 (QVGA), 400x296 (CIF), 640x480 (VGA, default), 800x600 (SVGA),
                                                        //               1024x768 (XGA), 1280x1024 (SXGA), 1600x1200 (UXGA)
   int cameraImageExposure = 0;                         // Camera exposure (0 - 1200)   If gain and exposure both set to zero then auto adjust is enabled
   int cameraImageGain = 0;                             // Image gain (0 - 30)
   int cameraImageBrightness = 0;                       // Image brightness (-2 to +2)
   const int camChangeDelay = 200;                      // delay when deinit camera executed

