MoCoMakers/night_world_leds/ESP32_controller/led_controller/ESP32camLEDController/ESP32camLEDController.ino
      String message = "Rebooting....";
      server.send(200, "text/plain", message);   // send reply as plain text

      // rebooting
        delay(500);          // give time to send the above html
        ESP.restart();
        delay(5000);         // restart fails without this delay
}


// ----------------------------------------------------------------
//       -test procedure    i.e. http://x.x.x.x/test
// ----------------------------------------------------------------

void handleTest() {

 WiFiClient client = server.client();                                                        // open link with client

 // log page request including clients IP
   IPAddress cIP = client.remoteIP();
   if (serialDebug) Serial.println("Test page requested by " + cIP.toString());

 // html header
   sendHeader(client, "Testing");


 // html body


 // -------------------------------------------------------------------




                          // test code goes here




// demo of drawing on the camera image using javascript / html canvas
//   could be of use to show area of interest on the image etc. - see https://www.w3schools.com/html/html5_canvas.asp
// creat a DIV and put image in it with a html canvas on top of it
  int imageWidth = 640;   // image dimensions on web page
  int imageHeight = 480;
  client.println("<div style='display:inline-block;position:relative;'>");
  client.println("<img style='position:absolute;z-index:10;' src='/jpg' width='" + String(imageWidth) + "' height='" + String(imageHeight) + "' />");
  client.println("<canvas style='position:relative;z-index:20;' id='myCanvas' width='" + String(imageWidth) + "' height='" + String(imageHeight) + "'></canvas>");
  client.println("</div>");
// javascript to draw on the canvas
  client.println("<script>");
  client.println("var imageWidth = " + String(imageWidth) + ";");
  client.println("var imageHeight = " + String(imageHeight) + ";");
  client.print (R"=====(
    // connect to the canvas
      var c = document.getElementById("myCanvas");
      var ctx = c.getContext("2d");
      ctx.strokeStyle = "red";
    // draw on image
      ctx.rect(imageWidth / 2, imageHeight / 2, 60, 40);                              // box
      ctx.moveTo(20, 20); ctx.lineTo(200, 100);                                       // line
      ctx.font = "30px Arial";  ctx.fillText("Hello World", 50, imageHeight - 50);    // text
      ctx.stroke();
   </script>\n)=====");


// // flip image horizontally
//   sensor_t *s = esp_camera_sensor_get();
//   s->set_hmirror(s, 1);


/*
 // demo of how to request a web page
   String page = "http://urlhere.com";   // url to request
   String response;                             // reply will be stored here
   int httpCode = requestWebPage(&page, &response);
   // show results
     client.println("Web page requested: '" + page + "' - http code: " + String(httpCode));
     client.print("<xmp>'");     // enables the html code to be displayed
     client.print(response);
     client.println("'</xmp><br>");
*/


/*
//  // demo useage of the mcp23017 io chipnote: this stops PWM on the flash working for some reason
    #if useMCP23017 == 1
      while(1) {
          mcp.digitalWrite(0, HIGH);
          int q = mcp.digitalRead(8);
          client.print("<p>HIGH, input =" + String(q) + "</p>");
          delay(1000);
          mcp.digitalWrite(0, LOW);
          client.print("<p>LOW</p>");
          delay(1000);
      }
    #endif
*/


 // -------------------------------------------------------------------

 client.println("<br><br><a href='/'>Return</a>");       // link back
 sendFooter(client);     // close web page

}  // handleTest


// LED STRIP FUNCTIONS

void writeColor(int r, int g, int b, int brightness, int startLED, int stopLED) {
  if (brightness > MAX_BRIGHTNESS) {
    brightness = MAX_BRIGHTNESS;
  }

  // Apply brightness to RGB values directly
  r = (r * brightness) >> 8;
  g = (g * brightness) >> 8;
  b = (b * brightness) >> 8;
  for(uint16_t i = startLED; i < stopLED; i++) {
    strip.setPixelColor(i, strip.Color(r, g, b)); // Draw new pixel
  }
  strip.show();
}

void writePixelNoShow(int n, int r, int g, int b, int brightness) {
  brightness = (brightness > MAX_BRIGHTNESS) ? MAX_BRIGHTNESS : brightness;

  // Apply brightness to RGB values directly using a more efficient bit shift
  r = (r * brightness) >> 8;
  g = (g * brightness) >> 8;
  b = (b * brightness) >> 8;

  strip.setPixelColor(n, r, g, b); // Draw new pixel
}


// ----------------------------------------------------------------
//     -set LEDs to a green    i.e. http://x.x.x.x/green
// ----------------------------------------------------------------

bool handleLEDGreen() {

  int r = 0;
  int g = 255;
  int b = 0;
  int brightness = 2; // 2 to 255 - 1 is not visible
  writeColor(r,g,b,brightness, 0, strip.numPixels()-1);

  WiFiClient client = server.client();          // open link with client

  sendBasicHeader(client, "Green LED");

  client.printf(R"=====(
    <h1>
      Green LEDs Written
    </h1>
    )=====");
  
  sendFooter(client);
  return 1;

}  // handleLEDGreen

// ----------------------------------------------------------------
//     -set LEDs to a white    i.e. http://x.x.x.x/white
// ----------------------------------------------------------------

bool handleLEDWhite() {

  int r = 255;
  int g = 255;
  int b = 255;
  int brightness = 255; // 2 to 255 - 1 is not visible
  writeColor(r,g,b,brightness, 0, strip.numPixels());

  WiFiClient client = server.client();          // open link with client

  sendBasicHeader(client, "White LED");

  client.printf(R"=====(
    <h1>
      White LEDs Written
    </h1>
    )=====");
  
  sendFooter(client);
  return 1;

}  // handleLEDWhite

// ----------------------------------------------------------------
//     -set LEDs to a black    i.e. http://x.x.x.x/black
// ----------------------------------------------------------------

bool handleLEDBlack() {

  int r = 0;
  int g = 0;
  int b = 0;
  int brightness = 0; // 2 to 255 - 1 is not visible
  // Add 300 extra to ensure everything is really off
  //Ensure full blackness, for 300 pixels long, longer than the strip
  for(uint16_t i = 0; i < 300; i++) {
    excess_strip.setPixelColor(i, excess_strip.Color(0, 0, 0)); // Draw new pixel
  }
  excess_strip.show();
  
  WiFiClient client = server.client();          // open link with client

  sendBasicHeader(client, "Black LED");

