MoCoMakers/night_world_leds/ESP32_controller/led_controller/ESP32camLEDController/ESP32camLEDController.ino
  client.printf(R"=====(
    <h1>
      Black LEDs Written
    </h1>
    )=====");
  
  sendFooter(client);
  return 1;

}  // handleLEDWhite



// ----------------------------------------------------------------
//     -set LEDs to a green    i.e. http://x.x.x.x/colorAll?r=255&g=255&b=255&brightness=127
// ----------------------------------------------------------------

bool handleColorChange(){
  // Parse the input values from the client
  WiFiClient client = server.client();
  if (!client) return 0;

  Serial.println("receiving from remote server");
  Serial.println(server.arg("r"));
  Serial.println(server.arg("g"));
  Serial.println(server.arg("b"));
  Serial.println(server.arg("brightness"));


  int r = server.arg("r").toInt();
  int g = server.arg("g").toInt();
  int b = server.arg("b").toInt();
  int brightness = server.arg("brightness").toInt();

  writeColor(r, g, b, brightness, 0, strip.numPixels());
  
  sendBasicHeader(client, "LED Control");
  client.printf(R"=====(<h1>LEDs Color Set</h1><p>R=%d G=%d B=%d Brightness=%d</p>)=====", r, g, b, brightness);
  sendFooter(client);
  return 1;
}  // handleColorChange


// ----------------------------------------------------------------
//     -set LEDs to a given color, in a given range of LED indicies    i.e. http://x.x.x.x/colorRange?i1r=255&i1g=255&i1b=255&i1brightness=127&i2r=255&i2g=255&i2b=255&i2brightness=127
//      Each i-th index in the URL is an LED index with an r,g,b, and brightness value required
// ----------------------------------------------------------------

bool handleRangeColorChange() {
    // Parse the input values from the client
    WiFiClient client = server.client();
    if (!client) return 0;

    int declaredPixels = 0;
    String arg_prefix, r_str, g_str, b_str, brightness_str;
    int r, g, b, brightness;

    for (int i = 0; i < N_LEDS; i++) {

        writePixelNoShow(i, 0, 0, 0, 0);
        arg_prefix = "i" + String(i);
        
        r_str = server.arg(arg_prefix + "r");
        g_str = server.arg(arg_prefix + "g");
        b_str = server.arg(arg_prefix + "b");

        brightness_str = server.arg(arg_prefix + "brightness");
        
        if (!r_str.isEmpty() && !g_str.isEmpty() && !b_str.isEmpty() && !brightness_str.isEmpty()) {
            r = r_str.toInt();
            g = g_str.toInt();
            b = b_str.toInt();
            brightness = brightness_str.toInt();
            //writeColor(r, g, b, brightness, i, i+1);
            writePixelNoShow(i, r, g, b, brightness);
            declaredPixels++;
        }
    }
    // Need to avoid flickers. Delay should be proportional to number of pixels.
    delay(30);

    strip.show();

    
  

    sendBasicHeader(client, "Range Color Change");
    client.printf(R"=====(<h1>Range Color Set</h1><p>Updated LED colors successfully.</p><p>Number of LEDs Updated: %d</p>)=====", declaredPixels);
    sendFooter(client);

    return 1;
}


// ----------------------------------------------------------------
//     -set LEDs to a white, in a given range of LED indicies    i.e. http://x.x.x.x/notifyFaceDetected
// ----------------------------------------------------------------

bool handleNotifyFaceDetected() {


 // Parse the input values from the client
    WiFiClient client = server.client();
    if (!client) return 0;

    for (int i = 0; i < N_LEDS; i++) {

        writePixelNoShow(i, 255, 255, 255, 127);
    }
    // Need to avoid flickers. Delay should be proportional to number of pixels.
    delay(30);

    strip.show();

    sendBasicHeader(client, "Face detected");
    client.printf(R"=====(<h1>Face Detected<h1>)=====");
    sendFooter(client);

    delay(5000);


    return 1;
}



// ******************************************************************************************************************
// end
